Revit 2027 API
GroupTypeId.RailingSystemFamilyTopRail Property
 Top Rail.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RailingSystemFamilyTopRail { get; }
Public Shared ReadOnly Property RailingSystemFamilyTopRail As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RailingSystemFamilyTopRail {
	ForgeTypeId^ get ();
}
static member RailingSystemFamilyTopRail : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace